Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Unpin Result
fr: Désattacher le résultat
ko: 결과 고정 해제
tr: Sonucun Sabitlemesini Kaldır
vi: Bỏ ghim kết quả
zh_hans: 取消固定结果
zh_hant: 取消釘選結果

source: Estimated Width
fr: Largeur estimée
ko: 예상 너비
tr: Tahmini Genişlik
vi: Độ rộng ước tính
zh_hans: 估算宽度
zh_hant: 估算寬度

source: What to compare, and how
fr: Ce qu'il faut comparer, et comment
ko: 무엇을 어떻게 비교할지
tr: Neler karşılaştırılacak ve nasıl
vi: So sánh những gì và như thế nào
zh_hans: 比较哪些内容，以及如何比较
zh_hant: 比較哪些內容，以及如何比較

source: No valid rows found in clipboard data.
fr: Aucune ligne valide n'a été trouvée dans les données du presse-papiers.
ko: 클립보드 데이터에서 유효한 행을 찾을 수 없습니다.
tr: Pano verisinde geçerli satır bulunamadı.
vi: Không tìm thấy dòng hợp lệ trong dữ liệu bộ nhớ tạm.
zh_hans: 剪贴板数据中未找到有效行。
zh_hant: 在剪貼簿資料中找不到有效的列。

source: ACTIVE CONNECTIONS
fr: CONNECTIONS ACTIVES
ko: 활성 연결
tr: AKTİF BAĞLANTILAR
vi: KẾT NỐI ĐANG HOẠT ĐỘNG
zh_hans: 活跃连接
zh_hant: 使用中的連線

source: Connection policy
fr: Politique de connexion
ko: 연결 정책
tr: Bağlantı politikası
vi: Chính sách kết nối
zh_hans: 连接策略
zh_hant: 連線原則

source: Your connections file was changed outside TablePro, so this connection's password source was not run. Open the connection and save it again to confirm the change.
fr: Votre fichier de connexions a été modifié en dehors de TablePro, donc la source du mot de passe de cette connexion n'a pas été exécutée. Ouvrez la connexion et enregistrez-la à nouveau pour confirmer le changement.
ko: TablePro 외부에서 연결 파일이 변경되어 이 연결의 암호 소스를 실행하지 않았습니다. 연결을 열고 다시 저장하여 변경 사항을 확인하십시오.
tr: Bağlantı dosyanız TablePro dışında değiştirildi, bu yüzden bu bağlantının parola kaynağı çalıştırılmadı. Değişikliği onaylamak için bağlantıyı açıp yeniden kaydedin.
vi: Tệp kết nối của bạn đã bị thay đổi bên ngoài TablePro, nên nguồn mật khẩu của kết nối này không được chạy. Hãy mở kết nối và lưu lại để xác nhận thay đổi.
zh_hans: 你的连接文件在 TablePro 之外被修改过，因此没有运行此连接的密码来源。请打开该连接并重新保存以确认这次更改。
zh_hant: 你的連線檔案在 TablePro 之外被修改過，因此沒有執行此連線的密碼來源。請開啟該連線並重新儲存以確認這次變更。

source: Select an object on the left to edit its privileges.
fr: Sélectionnez un objet à gauche pour modifier ses privilèges.
ko: 권한을 편집할 왼쪽의 객체를 선택하십시오.
tr: Yetkilerini düzenlemek için soldan bir nesne seçin.
vi: Chọn một đối tượng ở bên trái để sửa quyền của nó.
zh_hans: 在左侧选择一个对象以编辑其权限。
zh_hant: 在左側選擇一個物件以編輯其權限。

source: Maximum row limit
fr: Limite maximale de rangée
ko: 최대 행 제한
tr: Maksimum satır limiti
vi: Giới hạn dòng tối đa
zh_hans: 最大行数限制
zh_hant: 最大列數限制

source: No Schemas Available
fr: Aucun schéma disponible
ko: 사용 가능한 스키마 없음
tr: Kullanılabilir Şema Yok
vi: Không có schema nào
zh_hans: 没有可用的 Schema
zh_hant: 沒有可用的綱要

source: SQL statements
fr: Statements SQL

# The SSH agent from %@ holds no keys. %@
source: The SSH agent from %1$@ holds no keys. %2$@
fr: L'agent SSH de %1$@ ne possède aucune clé. %2$@

source: %d rows
fr: %d lignes
ko: %d개 행
tr: %d satır
vi: %d hàng
zh_hans: %d 行
zh_hant: %d 列

source: MCP Server: Failed
fr: Serveur MCP : Échec
ko: MCP 서버: 실패
tr: MCP Sunucusu: Başarısız
vi: MCP Server: Thất bại
zh_hans: MCP 服务器：失败
zh_hant: MCP 伺服器：失敗

source: Open database
fr: Base de données ouverte
ko: 데이터베이스 열기
vi: Mở cơ sở dữ liệu
zh_hans: 打开数据库
zh_hant: 開啟資料庫

source: This file is encrypted
fr: Ce fichier est crypté
ko: 이 파일은 암호화되어 있습니다
tr: Bu dosya şifrelenmiş
vi: Tệp này được mã hóa
zh_hans: 此文件已加密
zh_hant: 此檔案已加密

source: Choose a source and a target first.
fr: Choisissez d'abord une source et une cible.
ko: 먼저 원본과 대상을 선택하십시오.
tr: Önce bir kaynak ve bir hedef seçin.
vi: Hãy chọn nguồn và đích trước.
zh_hans: 请先选择来源和目标。
zh_hant: 請先選擇來源和目標。

source: Every geometry in this column is empty or null.
fr: Chaque géométrie de cette colonne est vide ou nulle.

source: Local only, not synced to iCloud
fr: Seulement local, pas synchronisé avec iCloud
ko: 로컬 전용, iCloud에 동기화되지 않음
tr: Yalnızca yerel, iCloud ile eşzamanlanmaz
vi: Chỉ lưu cục bộ, không đồng bộ với iCloud
zh_hans: 仅本地存储，不同步到 iCloud
zh_hant: 僅儲存於本機，不會同步到 iCloud

source: Could not be read: %@
fr: Impossible de lire : %@

source: A Data Pump job for %1$@ was started, writing to %2$@. Watch DBA_DATAPUMP_JOBS for its progress.
fr: Un travail de pompe de données pour %1$@ a été lancé, écrivant à %2$@. Surveillez DBA_DATAPUMP_JOBS pour suivre son évolution.

source: Activate
fr: Activer
ko: 활성화
tr: Etkinleştir
vi: Kích hoạt
zh_hans: 激活
zh_hant: 啟用

source: JSON Viewer
fr: Visualiseur JSON
ko: JSON 뷰어
tr: JSON Görüntüleyici
vi: Trình xem JSON
zh_hans: JSON 查看器
zh_hant: JSON 檢視器

source: Forward
fr: Avant
ko: 앞으로
tr: İleri
vi: Tiến tới
zh_hans: 前进
zh_hant: 前進

source: primary key
fr: Clé primaire

source: This license expires in %lld days.
fr: Cette licence expire dans %lld jours.
ko: 이 라이선스는 %lld일 후 만료됩니다.
tr: Bu lisansın süresi %lld gün sonra doluyor.
vi: Giấy phép này hết hạn sau %lld ngày.
zh_hans: 此许可证将在 %lld 天后过期。
zh_hant: 此授權將在 %lld 天後到期。

source: For
fr: Pour

source: Git is not installed. Install the Command Line Tools or Xcode to see file history.
fr: Git n'est pas installé. Installez les outils de ligne de commande ou Xcode pour voir l'historique des fichiers.

source: Could not read the referenced table
fr: Impossible de lire la table référencée

source: Create New Tag…
fr: Créer une nouvelle balise...
ko: 새 태그 생성…
tr: Yeni Etiket Oluştur…
vi: Tạo thẻ mới…
zh_hans: 创建新标签…
zh_hant: 建立新標籤…

source: Open a database to browse its tables.
fr: Ouvrez une base de données pour parcourir ses tables.
ko: 테이블을 보려면 데이터베이스를 여세요.
tr: Tablolarına göz atmak için bir veritabanı açın.
vi: Mở một cơ sở dữ liệu để duyệt các bảng của nó.
zh_hans: 打开一个数据库以浏览其中的表。
zh_hant: 開啟一個資料庫以瀏覽其中的資料表。

source: Maximum rows to export (default 50000)
fr: Nombre maximum de lignes à exporter (par défaut 50000)
ko: 내보낼 최대 행 수(기본값 50000)
tr: Dışa aktarılacak maksimum satır sayısı (varsayılan 50000)
vi: Số hàng tối đa để xuất (mặc định 50000)
zh_hans: 导出行数上限（默认 50000）
zh_hant: 匯出列數上限（預設 50000）

source: Switch to Tab
fr: Passer à la barre d'onglets
ko: 탭으로 전환
tr: Sekmeye Geç
vi: Chuyển đến tab
zh_hans: 切换到标签页
zh_hant: 切換到分頁

source: This deletes this connection's query history. You cannot undo this.
fr: Cela supprime l'historique des requêtes de cette connexion. Vous ne pouvez pas annuler cela.
ko: 이 연결의 쿼리 기록을 삭제합니다. 이 작업은 실행 취소할 수 없습니다.
tr: Bu, bu bağlantının sorgu geçmişini siler. Bu işlem geri alınamaz.
vi: Thao tác này xoá lịch sử truy vấn của kết nối này. Bạn không thể hoàn tác.
zh_hans: 这会删除此连接的查询历史。此操作无法撤销。
zh_hant: 這會刪除此連線的查詢歷史。此動作無法復原。

source: Clear all history
fr: Effacer toute l'historique
ko: 모든 기록 지우기
tr: Tüm geçmişi temizle
vi: Xoá toàn bộ lịch sử
zh_hans: 清除全部历史
zh_hant: 清除全部歷程記錄

source: Version Unavailable
fr: Version indisponible

source: Whether the trigger is enabled
fr: Que le déclencheur soit activé ou non
ko: 트리거가 활성화되어 있는지 여부
tr: Tetikleyicinin etkin olup olmadığı
vi: Trigger có đang bật hay không
zh_hans: 该触发器是否启用
zh_hant: 該觸發器是否啟用

source: Column-oriented OLAP for big data
fr: OLAP orienté colonnes pour les grands données
ko: 빅데이터용 열 지향 OLAP
tr: Büyük veri için sütun yönelimli OLAP
vi: OLAP dạng cột cho dữ liệu lớn
zh_hans: 面向大数据的列式OLAP
zh_hant: 適用於大數據的欄式 OLAP

source: Cloud SQL Auth Proxy
fr: Proxy d'authentification Cloud SQL
tr: Cloud SQL Kimlik Doğrulama Proxy'si

source: Embedded and remote analytical SQL
fr: SQL analytique intégré et à distance
ko: 임베디드 및 원격 분석 SQL
tr: Gömülü ve uzak analitik SQL
vi: SQL phân tích nhúng và từ xa
zh_hans: 嵌入式与远程分析型 SQL
zh_hant: 嵌入式與遠端分析型 SQL

source: Output before the error:
fr: Sortie avant l'erreur :

source: This engine has no SQL dialect, so tables cannot be selected generically.
fr: Ce moteur n'a pas de dialecte SQL, donc les tables ne peuvent pas être sélectionnées de manière générique.
ko: 이 엔진에는 SQL 방언이 없어 테이블을 일반적인 방식으로 조회할 수 없습니다.
tr: Bu motorun bir SQL lehçesi yok, bu yüzden tablolar genel bir şekilde seçilemiyor.
vi: Engine này không có phương ngữ SQL nên không thể select bảng theo cách tổng quát.
zh_hans: 此引擎没有 SQL 方言，因此无法以通用方式查询表。
zh_hant: 此引擎沒有 SQL 方言，因此無法以通用方式查詢資料表。

source: Threads
fr: Tissus
ko: 스레드
tr: İş Parçacıkları
vi: Luồng
zh_hans: 线程
zh_hant: 執行緒

source: Unfold All
fr: Développer tout
ko: 모두 펼치기
tr: Tümünü Aç
vi: Mở rộng tất cả
zh_hans: 全部展开
zh_hant: 全部展開

source: Remove %@
fr: Supprimer %@
ko: %@ 제거
tr: %@ Öğesini Kaldır
vi: Gỡ %@
zh_hans: 移除%@
zh_hant: 移除%@

source: SQL Functions
fr: Fonctions SQL
ko: SQL 함수
tr: SQL Fonksiyonları
vi: Hàm SQL
zh_hans: SQL 函数
zh_hant: SQL 函式

source: Apply this filter
fr: Appliquer ce filtre
ko: 이 필터 적용
tr: Bu filtreyi uygula
vi: Áp dụng bộ lọc này
zh_hans: 应用此筛选
zh_hant: 套用此篩選

source: No links are trusted yet.
fr: Aucun lien n'est encore pris en compte.
ko: 아직 신뢰된 링크가 없습니다.
tr: Henüz güvenilen bağlantı yok.
vi: Chưa có liên kết nào được tin cậy.
zh_hans: 尚未信任任何链接。
zh_hant: 尚未信任任何連結。

source: WHERE clause
fr: Clause OÙ
ko: WHERE 절
tr: WHERE ifadesi
vi: Mệnh đề WHERE
zh_hans: WHERE 子句
zh_hant: WHERE 子句

source: The query failed.
fr: La requête a échoué.

source: Restrict to a specific connection (UUID, optional)
fr: Restreindre à une connexion spécifique (UUID, facultatif)
ko: 특정 연결로 제한(UUID, 선택 사항)
tr: Belirli bir bağlantıyla sınırla (UUID, isteğe bağlı)
vi: Giới hạn theo một kết nối cụ thể (UUID, tùy chọn)
zh_hans: 限制为特定连接（UUID，可选）
zh_hant: 限制為特定連線（UUID，選用）

source: Enter the passphrase for SSH key "%@":
fr: Entrez le mot de passe pour la clé SSH "%@" :
ko: SSH 키 "%@"의 암호를 입력하십시오:
tr: SSH anahtarı "%@" için parolayı girin:
vi: Nhập cụm mật khẩu cho khoá SSH "%@":
zh_hans: 请输入 SSH 密钥 "%@" 的密码：
zh_hant: 請輸入 SSH 金鑰「%@」的密碼短語：

source: TLS Server Name
fr: Nom du serveur TLS

source: First row is a header
fr: La première rangée est un en-tête

source: Load Template
fr: Charger le modèle
ko: 템플릿 불러오기
tr: Şablon Yükle
vi: Tải mẫu
zh_hans: 加载模板
zh_hant: 載入範本

source: Access Application
fr: Accès à l'application
ko: Access 애플리케이션
tr: Access uygulaması
vi: Ứng dụng Access
zh_hans: Access应用程序
zh_hant: Access 應用程式

# %@/%@ rows
source: %1$@/%2$@ rows
fr: %1$@/%2$@ lignes
ko: %1$@/%2$@행
tr: %@/%@ satır
vi: %1$@/%2$@ dòng
zh_hans: %@/%@ 行
zh_hant: %1$@/%2$@ 列

source: This index needs at least one column.
fr: Cet index a besoin d'au moins une colonne.

source: Refresh Now
fr: Recharger maintenant
ko: 지금 새로 고침
tr: Şimdi Yenile
vi: Làm mới ngay
zh_hans: 立即刷新
zh_hant: 立即重新整理

source: %1$d rows use %2$@, which cannot be drawn.
fr: %1$d lignes utilisent %2$@, qui ne peut pas être tracée.

source: Preferred performs a 2-pass connect: tries TLS first, falls back to plain only on SSL handshake errors. Required by Cloud SQL and Azure MySQL.
fr: Preferred effectue une connexion en 2 passes : essaie d'abord TLS, passe uniquement à la connexion simple en cas d'erreurs de handshake SSL. Nécessaire pour Cloud SQL et Azure MySQL.
ko: 선호는 2단계 연결을 수행합니다. 먼저 TLS를 시도하고 SSL 핸드셰이크 오류가 발생한 경우에만 평문 연결로 전환합니다. Cloud SQL과 Azure MySQL에는 필수를 사용해야 합니다.
tr: Tercih Edilen 2 aşamalı bağlanır: önce TLS dener, yalnızca SSL el sıkışma hatalarında düz bağlantıya döner. Cloud SQL ve Azure MySQL için Zorunlu gerekir.
vi: Preferred kết nối 2 bước: thử TLS trước, chỉ chuyển sang kết nối thường khi gặp lỗi bắt tay SSL. Cloud SQL và Azure MySQL yêu cầu Required.
zh_hans: “首选”执行两阶段连接：先尝试 TLS，仅在 SSL 握手出错时回退到明文。Cloud SQL 和 Azure MySQL 要求使用“必需”。
zh_hant: 「首選」執行兩階段連線：先嘗試 TLS，僅在 SSL 交握出錯時回退到明文。Cloud SQL 與 Azure MySQL 要求使用「必要」。

source: Destination for %@
fr: Destination pour %@

source: Writing to %@
fr: Écrire à %@

source: Connection is read-only. Destructive operations are not permitted.
fr: La connexion est en lecture seule. Les opérations destructrices ne sont pas autorisées.
ko: 연결이 읽기 전용입니다. 파괴적 작업은 허용되지 않습니다.
tr: Bağlantı salt okunur. Yıkıcı işlemlere izin verilmez.
vi: Kết nối chỉ đọc. Không cho phép các thao tác phá hủy.
zh_hans: 连接为只读。不允许破坏性操作。
zh_hant: 連線為唯讀。不允許破壞性操作。

# Update row %@ in %@
source: Update row %1$@ in %2$@
fr: Mettre à jour la ligne %1$@ dans %2$@
ko: %2$@의 행 %1$@ 업데이트
tr: %2$@ içindeki %1$@ satırını güncelle
vi: Cập nhật dòng %1$@ trong %2$@
zh_hans: 更新 %2$@ 中的行 %1$@
zh_hant: 更新 %2$@ 中的列 %1$@

source: An enum's labels in declaration order
fr: Les étiquettes d'un enum dans l'ordre de déclaration

source: Maximum matches to return (1-500, default 50)
fr: Nombre maximum de correspondances à retourner (1-500, par défaut 50)
ko: 반환할 최대 일치 수(1~500, 기본값 50)
tr: Döndürülecek en fazla eşleşme (1-500, varsayılan 50)
vi: Số kết quả khớp tối đa trả về (1-500, mặc định 50)
zh_hans: 最多返回多少匹配项（1-500，默认 50）
zh_hant: 最多回傳多少符合項目（1-500，預設 50）

source: Expand in Sidebar
fr: Développer dans la barre latérale
ko: 사이드바에서 펼치기
tr: Kenar Çubuğunda Genişlet
vi: Mở rộng trong sidebar
zh_hans: 在侧边栏中展开
zh_hant: 在側邊欄中展開

source: Approximate row count reported by the engine
fr: Nombre approximatif de lignes signalé par le moteur

source: “%@” is compressed.
fr: «%@» est compressé.

source: Content
fr: Contenu

source: , and %lld more
fr: , et %lld de plus
ko: , 외 %lld개
tr: ve %lld tane daha
vi: và %lld mục nữa
zh_hans: ，还有 %lld 项
zh_hant: ，還有 %lld 項

source: Unsupported encryption version %u
fr: Version d'encodage non prise en charge %u
ko: 지원되지 않는 암호화 버전 %u
tr: Desteklenmeyen şifreleme sürümü %u
vi: Phiên bản mã hóa không được hỗ trợ %u
zh_hans: 不支持的加密版本 %u
zh_hant: 不支援的加密版本 %u

source: The pairing challenge is malformed.
fr: Le défi de jumelage est mal formé.
ko: 페어링 챌린지의 형식이 잘못되었습니다.
tr: Eşleştirme sınaması hatalı biçimlendirilmiş.
vi: Challenge ghép nối bị sai định dạng.
zh_hans: 配对质询格式不正确。
zh_hant: 配對挑戰格式不正確。

source: Labels
fr: Étiquettes

source: Trust
fr: Confiance
ko: 신뢰
tr: Güven
vi: Tin cậy
zh_hans: 信任
zh_hant: 信任

source: Server Configuration
fr: Configuration du serveur
ko: 서버 구성
tr: Sunucu Yapılandırması
vi: Cấu hình server
zh_hans: 服务器配置
zh_hant: 伺服器設定

source: Paste a connection URL. We'll detect the database type and pre-fill the form.
fr: Coller une URL de connexion. Nous détecterons le type de base de données et remplirons le formulaire à l'avance.
ko: 연결 URL을 붙여넣으십시오. 데이터베이스 유형을 감지하여 양식을 미리 채웁니다.
tr: Bir bağlantı URL'si yapıştırın. Veritabanı türünü algılayıp formu önceden dolduracağız.
vi: Dán URL kết nối. Ứng dụng sẽ nhận diện loại cơ sở dữ liệu và điền sẵn biểu mẫu.
zh_hans: 粘贴连接 URL，将自动检测数据库类型并预填表单。
zh_hant: 貼上連線 URL，將自動偵測資料庫類型並預先填入表單。

source: Delete Preset
fr: Supprimer le paramètre prédéfini
ko: 프리셋 삭제
tr: Ön Ayarı Sil
vi: Xóa mẫu đặt trước
zh_hans: 删除预设
zh_hant: 刪除預設組合

source: Import Connection from Link
fr: Importer la connexion depuis le lien
ko: 링크에서 연결 가져오기
tr: Bağlantıyı Linkten İçe Aktar
vi: Nhập kết nối từ liên kết
zh_hans: 从链接导入连接
zh_hant: 從連結匯入連線

source: Sync paused, Pro license expired
fr: Synchronisation suspendue, licence Pro expirée
ko: 동기화 일시 중지, Pro 라이선스 만료
tr: Eşitleme duraklatıldı, Pro lisansının süresi doldu
vi: Đồng bộ đã tạm dừng, giấy phép Pro đã hết hạn
zh_hans: 同步已暂停，Pro 许可证已过期
zh_hant: 同步已暫停，Pro 授權已過期

source: Cannot save schema changes: connection is read-only.
fr: Impossible d'enregistrer les modifications du schéma : la connexion est en lecture seule.
ko: 스키마 변경 사항을 저장할 수 없습니다. 연결이 읽기 전용입니다.
tr: Şema değişiklikleri kaydedilemez: bağlantı salt okunur.
vi: Không thể lưu thay đổi schema: kết nối chỉ đọc.
zh_hans: 无法保存 schema 更改：连接为只读。
zh_hant: 無法儲存綱要變更：連線為唯讀。

source: Process exited with code %d
fr: Le processus a été terminé avec le code %d
ko: 프로세스가 코드 %d(으)로 종료되었습니다
tr: İşlem %d koduyla çıktı
vi: Tiến trình thoát với mã %d
zh_hans: 进程退出，退出码 %d
zh_hant: 處理程序結束，結束碼 %d

source: Copy error message
fr: Copier le message d'erreur
ko: 오류 메시지 복사
tr: Hata mesajını kopyala
vi: Sao chép thông báo lỗi
zh_hans: 复制错误信息
zh_hant: 複製錯誤訊息

source: Bulk actions
fr: Actions en masse
ko: 일괄 작업
tr: Toplu işlemler
vi: Thao tác hàng loạt
zh_hans: 批量操作
zh_hant: 批次操作

source: Image preview
fr: Aperçu de l'image

source: QUICK
fr: Rapide
tr: HIZLI
vi: NHANH
zh_hans: 快速
zh_hant: 快速

source: Jump Hosts: %@
fr: Hôtes de saut : %@

source: The ChatGPT account could not be identified.
fr: Le compte ChatGPT n'a pas pu être identifié.
ko: ChatGPT 계정을 확인할 수 없습니다.
tr: ChatGPT hesabı tanımlanamadı.
vi: Không thể xác định tài khoản ChatGPT.
zh_hans: 无法识别 ChatGPT 账户。
zh_hant: 無法識別 ChatGPT 帳戶。

source: Edit
fr: Éditer
ko: 편집
tr: Düzenle
vi: Sửa
zh_hans: 编辑
zh_hant: 編輯

# Install the %@ plugin to open “%@”?
source: Install the %1$@ plugin to open “%2$@”?
fr: Installez le plugin %1$@ pour ouvrir "%2$@"?

# Applied to %@ at %@. 1 statement.
source: Applied to %1$@ at %2$@. 1 statement.
fr: Appliqué à %1$@ à %2$@. 1 déclaration.
ko: %2$@에 %1$@(으)로 적용했습니다. 구문 1개.
tr: %2$@ tarihinde %1$@ üzerine uygulandı. 1 ifade.
vi: Đã áp dụng vào %1$@ lúc %2$@. 1 câu lệnh.
zh_hans: 已于 %2$@ 应用到 %1$@。共 1 条语句。
zh_hant: 已於 %2$@ 套用到 %1$@。共 1 條陳述式。

source: Memory Fragmentation
fr: Fragmentation de la mémoire

source: Schema-qualified name
fr: Nom qualifié par le schéma
ko: 스키마로 정규화된 이름
tr: Şema nitelikli ad
vi: Tên có kèm schema
zh_hans: 带 Schema 限定的名称
zh_hant: 帶綱要限定的名稱

source: Empty array
fr: Tableau vide
ko: 빈 배열
tr: Boş dizi
vi: Mảng rỗng
zh_hans: 空数组
zh_hant: 空陣列

source: Window id, as reported by list_recent_tabs
fr: Identifiant de la fenêtre, tel que rapporté par list_recent_tabs
ko: list_recent_tabs가 보고하는 창 id
tr: list_recent_tabs'in bildirdiği şekliyle pencere kimliği
vi: Window id, đúng như list_recent_tabs báo cáo
zh_hans: 窗口 id，按 list_recent_tabs 报告的样子
zh_hant: 視窗 id，按 list_recent_tabs 回報的樣子

source: Restrict to one connection
fr: Restreindre à une seule connexion
ko: 한 연결로 제한
tr: Tek bir bağlantıyla sınırla
vi: Giới hạn trong một kết nối
zh_hans: 限定为一个连接
zh_hant: 限定為一個連線

source: The listener has no handler available for the requested service
fr: L'écouteur n'a pas de gestionnaire disponible pour le service demandé.
ko: 리스너에 요청한 서비스를 처리할 수 있는 핸들러가 없습니다
tr: Dinleyicide istenen hizmet için kullanılabilir işleyici yok
vi: Listener không có handler khả dụng cho dịch vụ được yêu cầu
zh_hans: 侦听器没有可用于所请求服务的处理程序
zh_hant: 接聽程式沒有可用於所請求服務的處理常式

source: Truncate
fr: Tronquer
ko: 비우기
zh_hans: 清空
zh_hant: 清空

source: Toggle History
fr: Changer l'historique
ko: 기록 표시/숨기기
tr: Geçmişi Aç/Kapat
vi: Bật/tắt lịch sử
zh_hans: 切换历史记录
zh_hant: 切換歷程記錄

source: The %1$@ sorted rows differently than the comparison expects, near key %2$@. Pick a numeric key, or one that sorts by byte value.
fr: Les lignes triées %1$@ sont triées différemment de ce que la comparaison attend, près de la clé %2$@. Choisissez une clé numérique, ou une qui trie par valeur en octets.
ko: %1$@이(가) 키 %2$@ 부근에서 비교가 예상한 것과 다른 순서로 행을 정렬했습니다. 숫자 키나 바이트 값으로 정렬되는 키를 선택하십시오.
tr: %1$@, satırları karşılaştırmanın beklediğinden farklı sıraladı, %2$@ anahtarının yakınında. Sayısal bir anahtar ya da bayt değerine göre sıralanan bir anahtar seçin.
vi: %1$@ đã sắp xếp các dòng khác với những gì so sánh mong đợi, gần khóa %2$@. Hãy chọn khóa dạng số, hoặc khóa sắp xếp theo giá trị byte.
zh_hans: %1$@ 对行的排序与比较预期不同，出现在键 %2$@ 附近。请选择数值型键，或按字节值排序的键。
zh_hant: %1$@ 對列的排序與比較預期不同，出現在鍵 %2$@ 附近。請選擇數值型鍵，或按位元組值排序的鍵。

source: Adding check constraint %@ scans the table and fails if any existing row violates it.
fr: L'ajout de la contrainte de vérification %@ effectue une vérification de la table et échoue si une ligne existante la viole.
ko: CHECK 제약 조건 %@을(를) 추가하면 테이블을 검사하며, 기존 행 중 하나라도 위반하면 실패합니다.
tr: %@ kontrol kısıtlaması eklemek tabloyu tarar ve mevcut satırlardan biri bunu ihlal ederse başarısız olur.
vi: Thêm ràng buộc CHECK %@ sẽ quét toàn bảng và thất bại nếu có dòng hiện có vi phạm.
zh_hans: 添加 CHECK 约束 %@ 会扫描整张表，若有任何现有行违反约束则会失败。
zh_hant: 新增 CHECK 約束 %@ 會掃描整張資料表，若有任何現有列違反約束則會失敗。

source: Server Metrics
fr: Mesures du serveur
ko: 서버 지표
tr: Sunucu Metrikleri
vi: Chỉ số máy chủ
zh_hans: 服务器指标
zh_hant: 伺服器指標

source: Open a session for a saved connection. Returns only after the driver is connected.
fr: Ouvrez une session pour une connexion enregistrée. Retourne uniquement après que le pilote soit connecté.
ko: 저장된 연결의 세션을 엽니다. 드라이버가 연결된 뒤에만 반환합니다.
tr: Kayıtlı bir bağlantı için oturum açar. Yalnızca sürücü bağlandıktan sonra döner.
vi: Mở một phiên cho kết nối đã lưu. Chỉ trả về sau khi driver đã kết nối.
zh_hans: 为一个已保存的连接打开会话。仅在驱动连接成功后才返回。
zh_hant: 為一個已儲存的連線開啟工作階段。僅在驅動程式連線成功後才回傳。

source: Check that the SSH server enables the sftp subsystem for this account.
fr: Vérifiez que le serveur SSH permet le sous-système sftp pour ce compte.
ko: SSH 서버가 이 계정에 대해 sftp 하위 시스템을 활성화했는지 확인하십시오.
tr: SSH sunucusunun bu hesap için sftp alt sistemini etkinleştirdiğini doğrulayın.
vi: Hãy kiểm tra xem máy chủ SSH có bật hệ thống con sftp cho tài khoản này không.
zh_hans: 请检查 SSH 服务器是否为该账户启用了 sftp 子系统。
zh_hant: 請檢查 SSH 伺服器是否為該帳號啟用了 sftp 子系統。

source: Condition
fr: État
ko: 조건
tr: Koşul
vi: Điều kiện
zh_hans: 条件
zh_hant: 條件

source: Plugin code signature verification failed: %@
fr: Vérification de la signature du code du plugin échouée : %@
ko: 플러그인 코드 서명 검증 실패: %@
tr: Eklenti kod imzası doğrulaması başarısız: %@
vi: Xác minh chữ ký mã plugin thất bại: %@
zh_hans: 插件代码签名验证失败：%@
zh_hant: 外掛程式碼簽章驗證失敗：%@

source: Journal Mode
fr: Mode journal
ko: 저널 모드
tr: Günlük Modu
vi: Chế độ journal
zh_hans: 日志模式
zh_hant: 日誌模式

source: Fast
fr: Rapide
ko: 빠름
tr: Hızlı
vi: Nhanh
zh_hans: 快速
zh_hant: 快速

source: Website
fr: Site web
ko: 웹사이트
vi: Trang web
zh_hans: 网站
zh_hant: 網站

source: The target database may be left in a partial state.
fr: La base de données cible peut rester en état partiel.
ko: 대상 데이터베이스가 불완전한 상태로 남을 수 있습니다.
tr: Hedef veritabanı kısmi bir durumda kalabilir.
vi: Cơ sở dữ liệu đích có thể bị bỏ lại ở trạng thái dở dang.
zh_hans: 目标数据库可能会处于不完整状态。
zh_hant: 目標資料庫可能會處於不完整的狀態。

source: The query contains a NUL character (U+0000) and was not run. Remove it and try again.
fr: La requête contient un caractère NUL (U+0000) et n'a pas été exécutée. Supprimez-le et réessayez.
ko: 쿼리에 NUL 문자(U+0000)가 있어 실행하지 않았습니다. 제거한 후 다시 시도하세요.
tr: Sorgu bir NUL karakteri (U+0000) içerdiği için çalıştırılmadı. Karakteri kaldırıp yeniden deneyin.
vi: Truy vấn chứa ký tự NUL (U+0000) nên chưa được chạy. Hãy xóa ký tự này rồi thử lại.
zh_hans: 查询包含 NUL 字符 (U+0000)，未执行。请删除后重试。
zh_hant: 查詢包含 NUL 字元 (U+0000)，未執行。請刪除後再試一次。

source: Column names, matching each row's value order
fr: Les noms des colonnes correspondent à l'ordre des valeurs de chaque ligne.
ko: 각 행의 값 순서와 일치하는 열 이름
tr: Her satırın değer sırasıyla eşleşen sütun adları
vi: Tên cột, khớp với thứ tự giá trị của mỗi dòng
zh_hans: 列名，与每行的值顺序一一对应
zh_hant: 欄位名稱，與每列的值順序一一對應

source: OAuth Client ID
fr: Identifiant client OAuth
ko: OAuth 클라이언트 ID

source: OracleNIO has no TLS fallback. Preferred connects in plain TCP. Use Required for TCPS to Oracle Autonomous Database.
fr: OracleNIO n'a pas de redondance TLS. Les connexions préférées se font en TCP clair. Utilisez "Required" pour les TCPS vers la base de données autonome Oracle.
ko: OracleNIO에는 TLS 폴백이 없습니다. 선호는 평문 TCP로 연결합니다. Oracle Autonomous Database에 TCPS로 연결하려면 필수를 사용하십시오.
tr: OracleNIO'da TLS geri dönüşü yoktur. Tercih Edilen düz TCP ile bağlanır. Oracle Autonomous Database'e TCPS bağlantısı için Zorunlu kullanın.
vi: OracleNIO không có cơ chế dự phòng TLS. Preferred kết nối bằng TCP thường. Dùng Required cho TCPS tới Oracle Autonomous Database.
zh_hans: OracleNIO 没有 TLS 回退。“首选”将使用纯 TCP 连接。通过 TCPS 连接 Oracle Autonomous Database 时请使用“必需”。
zh_hant: OracleNIO 沒有 TLS 回退。「首選」將使用純 TCP 連線。透過 TCPS 連線 Oracle Autonomous Database 時請使用「必要」。

source: Remove server?
fr: Supprimer le serveur ?

source: Open Project Folder
fr: Ouvrir le dossier du projet
ko: 프로젝트 폴더 열기
tr: Proje Klasörünü Aç
vi: Mở thư mục dự án
zh_hans: 打开项目文件夹
zh_hant: 開啟專案資料夾

source: The %d batches before it stay applied.
fr: Les %d lots avant cela restent appliqués.
